In [51]:
import pandas as pd
import numpy as np

In [52]:
df = pd.read_csv('iris.csv')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [54]:
df['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [55]:
from sklearn.preprocessing import LabelEncoder

In [56]:
lb = LabelEncoder() # the label encoding is used in most of the cases where we want to convert the object value to numrical values 

df['species'] = lb.fit_transform(df['species'])
df

     sepal_length  sepal_width  petal_length  petal_width  species
0             5.1          3.5           1.4          0.2        0
1             4.9          3.0           1.4          0.2        0
2             4.7          3.2           1.3          0.2        0
3             4.6          3.1           1.5          0.2        0
4             5.0          3.6           1.4          0.2        0
..            ...          ...           ...          ...      ...
145           6.7          3.0           5.2          2.3        2
146           6.3          2.5           5.0          1.9        2
147           6.5          3.0           5.2          2.0        2
148           6.2          3.4           5.4          2.3        2
149           5.9          3.0           5.1          1.8        2

[150 rows x 5 columns]

## get_dummies uses one hot encoding

In [57]:
# df = pd.get_dummies(df , columns = ['species'] , dtype = int) 
# get dummies uses one hot encoding in the backend .
# get dummies divided the unique elements of the specific column into the muliple columns .
# such that each unique element representing new column .

In [62]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width   species
sepal_length      1.000000    -0.109369      0.871754     0.817954  0.782561
sepal_width      -0.109369     1.000000     -0.420516    -0.356544 -0.419446
petal_length      0.871754    -0.420516      1.000000     0.962757  0.949043
petal_width       0.817954    -0.356544      0.962757     1.000000  0.956464
species           0.782561    -0.419446      0.949043     0.956464  1.000000

In [58]:
df

     sepal_length  sepal_width  petal_length  petal_width  species
0             5.1          3.5           1.4          0.2        0
1             4.9          3.0           1.4          0.2        0
2             4.7          3.2           1.3          0.2        0
3             4.6          3.1           1.5          0.2        0
4             5.0          3.6           1.4          0.2        0
..            ...          ...           ...          ...      ...
145           6.7          3.0           5.2          2.3        2
146           6.3          2.5           5.0          1.9        2
147           6.5          3.0           5.2          2.0        2
148           6.2          3.4           5.4          2.3        2
149           5.9          3.0           5.1          1.8        2

[150 rows x 5 columns]

In [59]:
df2_for_scaling = pd.read_csv('claimants.csv')

In [60]:
df2_for_scaling.head()

   ATTORNEY  CLMSEX  CLMINSUR  SEATBELT  CLMAGE    LOSS
0         0     0.0       1.0       0.0    50.0  34.940
1         1     1.0       0.0       0.0    18.0   0.891
2         1     0.0       1.0       0.0     5.0   0.330
3         0     0.0       1.0       1.0    31.0   0.037
4         1     0.0       1.0       0.0    30.0   0.038

In [61]:
df2_for_scaling.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1340 entries, 0 to 1339
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ATTORNEY  1340 non-null   int64
 1   CLMSEX    1328 non-null   float64
 2   CLMINSUR  1299 non-null   float64
 3   SEATBELT  1292 non-null   float64
 4   CLMAGE    1151 non-null   float64
 5   LOSS      1340 non-null   float64
dtypes: float64(5), int64(1)
memory usage: 62.9 KB

In [63]:
df2_for_scaling.isna().sum()

ATTORNEY      0
CLMSEX       12
CLMINSUR     41
SEATBELT     48
CLMAGE      189
LOSS          0
dtype: int64

In [66]:
df2_for_scaling.dropna(inplace = True)

In [67]:
df2_for_scaling.isna().sum()

ATTORNEY    0
CLMSEX      0
CLMINSUR    0
SEATBELT    0
CLMAGE      0
LOSS        0
dtype: int64

In [68]:
df2_for_scaling.corr()

          ATTORNEY    CLMSEX  CLMINSUR  SEATBELT    CLMAGE      LOSS
ATTORNEY  1.000000  0.097475  0.084609 -0.060795  0.001132 -0.225769
CLMSEX    0.097475  1.000000  0.058164 -0.017814 -0.017942 -0.029742
CLMINSUR  0.084609  0.058164  1.000000  0.021217  0.048166  0.019502
SEATBELT -0.060795 -0.017814  0.021217  1.000000 -0.028343  0.131182
CLMAGE    0.001132 -0.017942  0.048166 -0.028343  1.000000  0.065513
LOSS     -0.225769 -0.029742  0.019502  0.131182  0.065513  1.000000

In [71]:
x = df2_for_scaling[['CLMAGE' , 'LOSS']]
x

      CLMAGE    LOSS
0       50.0  34.940
1       18.0   0.891
2        5.0   0.330
3       31.0   0.037
4       30.0   0.038
...      ...     ...
1334    16.0   0.060
1336    46.0   3.705
1337    39.0   0.099
1338     8.0   3.177
1339    30.0   0.688

[1096 rows x 2 columns]

In [72]:
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler

In [ ]:
sc = StandardScaler() # transforms the value near the 0 the values can be +ve , -ve , greater than 1 , or greater thsn -1 , etc.it is normal.
# it has mean = 0 and standard deviation = 1.
x_std = sc.fit_transform(x)

In [74]:
x_std

array([[ 1.05048704,  2.96924493],
       [-0.51942439, -0.28328699],
       [-1.15720091, -0.33687653],
       ...,
       [ 0.51082998, -0.35894281],
       [-1.01002171, -0.06491676],
       [ 0.0692924 , -0.30267857]], shape=(1096, 2))

In [ ]:
minMax_scale = MinMaxScaler() # transforms the values between 0 and 1.
x_minMax = minMax_scale.fit_transform(x)

In [76]:
x_minMax

array([[0.52631579, 0.20126264],
       [0.18947368, 0.00513237],
       [0.05263158, 0.00190088],
       ...,
       [0.41052632, 0.00057026],
       [0.08421053, 0.01830027],
       [0.31578947, 0.00396304]], shape=(1096, 2))